		BASIC COMMANDS

\\ Change to privileged mode
switch> enable

\\ Access privileged mode
switch# configure terminal 

\\ Show router running configuration
router# show run

\\ Save the configuration
switch# copy running-config startup-config [y | n]
switch# write memory

\\ Connectivity test
switch# ping [destiny route]

\\ Show the MAC address table
switch# show mac address-table

\\ Exit the configuration mode
switch(config)# exit
switch(config)# end

\\ Change the hostname
switch(config)# hostname [new hostname]

\\ Turn on and off a port
switch(config)# interface gigabitethernet 1/0/1
switch(config-if)# no shutdown
switch(config-if)# shutdown

		VLAN MANAGEMENT

\\ Show the VLAN's
switch# show vlan brief

\\ Creating a new VLAN
switch# vlan database
switch(vlan)# vlan [vlan id] name [vlan name]

\\ Deleting a VLAN
switch(vlan)# no vlan [vlan id]

\\ Setting access port
switch(config)# interface gigabitethernet 1/0/1
switch(config-if)# switchport mode access
switch(config-if)# switchport access vlan [vlan id]

\\ Configuring a specific range of ports
switch(config)# interface range gigabitethernet 1/0/1 - 24
switch(config-if-range)# switchport mode access
switch(config-if-range)# switchport access vlan [vlan id]

		TRUNK CONFIGURATION

\\ Show trunked ports
switch# show interfaces trunk

\\ Configure trunk on a port
switch(config)# interface gigabitethernet 1/0/1
switch(config-if)# switchport mode trunk

\\ For specific type of encapsulation
switch(config-if)# switchport trunk encapsulation dot1q

\\ Select which VLAN's are allowed through a specific port 
switch(config-if)# switchport trunk allowed vlan [vlan id]

		GATEWAY CONFIGURATION

\\ Show the interfaces status
switch(config)# show ip interfaces brief

\\ Configuring a gateway address
switch(config)# interface vlan [vlan id]
switch(config-if)# ip address [ip] [subnet mask]
switch(config-if)# no shutdown

\\ Removing the gateway address
switch(config-if)# no ip address

\\ Enable and disable IP routing function
switch(config)# ip routing
switch(config)# no ip routing

\\ Forward of broadcast
switch(config)# interface vlan [vlan id]
switch(config-if)# ip helper-address [ip]

		STP PROTOCOL

\\ Show switch STP configuration
switch# show spanning-tree

\\ Show STP information for a specific VLAN
switch# show spanning-tree vlan [vlan id]

\\ Configure STP mode
switch(config)# spanning-tree mode [stp | rstp | mst]

\\ Set default path cost
switch(config)# spanning-tree pathcost method [long | short]

\\ Specifies brigde priority
switch(config)# spanning-tree vlan [vlan id] priority [value]

\\ Configure the max agr
switch(config)# spanning-tree max-age [seconds]

\\ Specifies the forwarding time
switch(config)# spanning-tree forward-time [seconds]

\\ Configure the loop guard
switch(config)# spanning-tree loopback-guard

		CHANNEL GROUP

\\ Show etherchannel summary
switch# show etherchannel summary

\\ Configuring using LACP
switch(config)# interface gigabitethernet 1/0/1 - 2
switch(config-if)# channel-group 1 mode active

\\ Configuring using PAgP
switch(config)# interface gigabitethernet 1/0/1 - 2
switch(config-if)# channel-group 1 mode desirable

		DEFAULT ROUTE 

\\ Show IP routing table
switch# show ip route

\\ Configuring a default route
router(config)# ip route 0.0.0.0 0.0.0.0 [next hop ip]

\\ Configure a static route
switch(config)# ip route [destination ip] [destination mask] [next router interface ip or outgoing interface ip]
switch(config)# no ip route [destination ip] [destination mask] [next router interface ip or outgoing interface ip]