		BASIC COMMANDS

\\ Change to privileged mode
switch> enable

\\ Access privileged mode
switch# configure terminal 

\\ Show interface configuration
switch# show interface gigabitethernet 1/0/1 switchport

\\ Save the configuration
switch# copy running-config startup-config [y | n]
switch# write memory

\\ Connectivity test
switch# ping [destiny route]

\\ Show the MAC address table
switch# show mac address-table

\\ Exit the configuration mode
switch(config)# exit
switch(config)# end

\\ Change the hostname
switch(config)# hostname [new hostname]

\\ Turn on and off a port
switch(config)# interface gigabitethernet 1/0/1
switch(config-if)# no shutdown
switch(config-if)# shutdown

		VLAN MANAGEMENT

\\ Show the VLAN's
switch# show vlan brief

\\ Creating a new VLAN
switch# vlan database
switch(vlan)# vlan [vlan id] name [vlan name]

\\ Deleting a VLAN
switch(vlan)# no vlan [vlan id]

\\ Configuring access port vlan
switch(config)# interface gigabitethernet 1/0/1
switch(config-if)# switchport mode access
switch(config-if)# switchport access vlan [vlan id]

\\ Configuring a voice vlan
switch(config)# interface gigabitethernet 1/0/1
switch(config-if)# switchport mode access
switch(config-if)# switchport voice vlan [vlan id]

\\ Configuring a specific range of ports
switch(config)# interface range gigabitethernet 1/0/1 - 24
switch(config-if-range)# switchport mode access
switch(config-if-range)# switchport access vlan [vlan id]

		VTP CONFIGURATION

\\ Show trunked ports
switch# show interfaces trunk

\\ Configure trunk on a port
switch(config)# interface gigabitethernet 1/0/1
switch(config-if)# switchport mode trunk

\\ For specific type of encapsulation
switch(config-if)# switchport trunk encapsulation dot1q

\\ Select which VLAN's are allowed through a specific port 
switch(config-if)# switchport trunk allowed vlan [vlan id]

		GATEWAY CONFIGURATION

\\ Show the interfaces status
switch(config)# show ip interfaces brief

\\ Configuring a gateway address
switch(config)# interface vlan [vlan id]
switch(config-if)# ip address [ip] [subnet mask]
switch(config-if)# no shutdown

\\ Removing the gateway address
switch(config-if)# no ip address

\\ Enable and disable IP routing function
switch(config)# ip routing
switch(config)# no ip routing

		STP CONFIGURATION

\\ Show switch STP configuration
switch# show spanning-tree

\\ Show STP information for a specific VLAN
switch# show spanning-tree vlan [vlan id]

\\ Configure STP mode
switch(config)# spanning-tree mode [stp | rstp | mst]

\\ Set default path cost
switch(config)# spanning-tree pathcost method [long | short]

\\ Specifies brigde priority
switch(config)# spanning-tree vlan [vlan id] priority [value]

\\ Configure the max agr
switch(config)# spanning-tree max-age [seconds]

\\ Specifies the forwarding time
switch(config)# spanning-tree forward-time [seconds]

\\ Configure the loop guard
switch(config)# spanning-tree loopback-guard

		ETHERCHANNEL CONFIGURATION

\\ Show etherchannel summary
switch# show etherchannel summary

\\ Configuring using LACP
switch(config)# interface range gigabitethernet 1/0/1 - 2
switch(config-if)# channel-group [channel id] mode active

\\ Configuring using PAgP
switch(config)# interface range gigabitethernet 1/0/1 - 2
switch(config-if)# channel-group [channel id] mode desirable

\\ Accessing the etherchannel configuration
(config)# interface port-channel [channel id]
(config-if)# switchport mode trunk

		DEFAULT ROUTE 

\\ Show IP routing table
switch# show ip route

\\ Configuring a default route
router(config)# ip route 0.0.0.0 0.0.0.0 [next hop ip]

\\ Configure a static route
switch(config)# ip route [destination ip] [destination mask] [next router interface ip or outgoing interface ip]
switch(config)# no ip route [destination ip] [destination mask] [next router interface ip or outgoing interface ip]

		DHCP CONFIGURATION

\\ Show the DHCP pool
switch# show ip dhcp pool

\\ Show a list of IP's dynamically assigned
switch# show ip dhcp binding

\\ Reserving IP addresses outside the DHCP pool
switch(config)# ip dhcp excluded-address [initial address] [final address]

\\ Creating a IP addresses pool
switch(config)# ip dhcp pool [pool name]
switch(dhcp-config)# network [network ip] [subnet mask]
switch(dhcp-config)# default router [gateway]
switch(dhcp-config)# dns-server [primary dns server] [secondary dns server]
switch(dhcp-config)# lease [value in days]

\\ DHCP request forwarding
switch(config)# interface vlan [vlan id]
switch(config-if)# ip helper-address [ip]

		HSRP CONFIGURATION

\\ Show HSRP configuration
switch# show standby brief

\\ HSRP basic configuration
switch(config)# interface vlan [vlan id]
switch(config-if)# standby version 2
switch(config-if)# standby 1 ip [gateway]
switch(config-if)# standby 1 priority [value] *standard value: 100
switch(config-if)# standby 1 preempt

